In [20]:
import pandas as pd 
from sqlalchemy import create_engine
import psycopg2

print("all libraries imported successfully")

all libraries imported successfully

In [21]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(
    "postgresql://postgres:newpassword123@localhost:5432/churn"
)

In [22]:
pd.read_sql("SELECT COUNT(*) FROM churn;", engine)

   count
0   7042

In [23]:
query = "SELECT * FROM churn_analysis_base;"
df = pd.read_sql(query, engine)

df.head()

,customer_id,tenure,phone_service,contract,paperless_billing,payment_method,monthly_charges,total_charges,churn
0,7590-VHVEG,1,False,Month-to-month,True,Electronic check,29.85,29.85,False
1,5575-GNVDE,34,True,One year,False,Mailed check,56.95,1889.50,False
2,3668-QPYBK,2,True,Month-to-month,True,Mailed check,53.85,108.15,True
3,7795-CFOCW,45,False,One year,False,Bank transfer (automatic),42.30,1840.75,False
4,9237-HQITU,2,True,Month-to-month,True,Electronic check,70.70,151.65,True

In [24]:
df.shape

(7042, 9)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7042 entries, 0 to 7041
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7042 non-null   object
 1   tenure             7042 non-null   int64
 2   phone_service      7042 non-null   bool
 3   contract           7042 non-null   object
 4   paperless_billing  7042 non-null   bool
 5   payment_method     7042 non-null   object
 6   monthly_charges    7042 non-null   float64
 7   total_charges      7042 non-null   float64
 8   churn              7042 non-null   bool
dtypes: bool(3), float64(2), int64(1), object(3)
memory usage: 350.9+ KB

In [26]:
df.describe()

            tenure  monthly_charges  total_charges
count  7042.000000      7042.000000    7042.000000
mean     32.366373        64.755886    2279.086083
std      24.557955        30.088238    2266.302524
min       0.000000        18.250000       0.000000
25%       9.000000        35.500000     398.550000
50%      29.000000        70.350000    1394.075000
75%      55.000000        89.850000    3783.600000
max      72.000000       118.750000    8684.800000

In [27]:
df.isnull().sum()

customer_id          0
tenure               0
phone_service        0
contract             0
paperless_billing    0
payment_method       0
monthly_charges      0
total_charges        0
churn                0
dtype: int64

In [28]:
df['churn_flag'] = df['churn'].astype(int)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7042 entries, 0 to 7041
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7042 non-null   object
 1   tenure             7042 non-null   int64
 2   phone_service      7042 non-null   bool
 3   contract           7042 non-null   object
 4   paperless_billing  7042 non-null   bool
 5   payment_method     7042 non-null   object
 6   monthly_charges    7042 non-null   float64
 7   total_charges      7042 non-null   float64
 8   churn              7042 non-null   bool
 9   churn_flag         7042 non-null   int32
dtypes: bool(3), float64(2), int32(1), int64(1), object(3)
memory usage: 378.4+ KB

In [30]:
df['churn_flag'] = df['churn'].apply(lambda x: 1 if x is True else 0)

In [31]:
df['tenure_group'] = pd.cut(
    df['tenure'],
    bins=[0,12,24,36,48,60,72],
    labels=['0-1 yr','1-2 yr','2-3 yr','3-4 yr','4-5 yr','5+ yr']
)

In [32]:
df.head()

,customer_id,tenure,phone_service,contract,paperless_billing,payment_method,monthly_charges,total_charges,churn,churn_flag,tenure_group
0,7590-VHVEG,1,False,Month-to-month,True,Electronic check,29.85,29.85,False,0,0-1 yr
1,5575-GNVDE,34,True,One year,False,Mailed check,56.95,1889.50,False,0,2-3 yr
2,3668-QPYBK,2,True,Month-to-month,True,Mailed check,53.85,108.15,True,1,0-1 yr
3,7795-CFOCW,45,False,One year,False,Bank transfer (automatic),42.30,1840.75,False,0,3-4 yr
4,9237-HQITU,2,True,Month-to-month,True,Electronic check,70.70,151.65,True,1,0-1 yr

In [33]:
df.tail()

,customer_id,tenure,phone_service,contract,paperless_billing,payment_method,monthly_charges,total_charges,churn,churn_flag,tenure_group
7037,3213-VVOLG,0,True,Two year,False,Mailed check,25.35,0.0,False,0,NaN
7038,2520-SGTTA,0,True,Two year,False,Mailed check,20.00,0.0,False,0,NaN
7039,2923-ARZLG,0,True,One year,True,Mailed check,19.70,0.0,False,0,NaN
7040,4075-WKNIU,0,True,Two year,False,Mailed check,73.35,0.0,False,0,NaN
7041,2775-SEFEE,0,True,Two year,True,Bank transfer (automatic),61.90,0.0,False,0,NaN

In [34]:
df.sample(5)

,customer_id,tenure,phone_service,contract,paperless_billing,payment_method,monthly_charges,total_charges,churn,churn_flag,tenure_group
348,6243-OZGFH,23,False,Month-to-month,True,Electronic check,44.95,996.85,False,0,1-2 yr
5781,0980-PVMRC,40,False,Month-to-month,True,Electronic check,50.85,2036.55,False,0,3-4 yr
2915,9453-PATOS,72,True,Two year,False,Mailed check,85.10,6155.40,False,0,5+ yr
2423,2519-FAKOD,38,True,Month-to-month,True,Bank transfer (automatic),99.25,3777.15,True,1,3-4 yr
5936,8421-WZOOW,57,True,Month-to-month,True,Credit card (automatic),95.30,5567.45,False,0,4-5 yr

In [35]:
df.to_csv("churn_final.csv", index=False)

In [36]:
import os
os.getcwd()

'C:\\Users\\sapna'